Revit 2027 API
Transform.CreateRotationAtPoint Method
 Creates a transform that represents a rotation about the given axis at the specified point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Transform CreateRotationAtPoint(
	XYZ axis,
	double angle,
	XYZ origin
)
Public Shared Function CreateRotationAtPoint (
	axis As XYZ,
	angle As Double,
	origin As XYZ
) As Transform
public:
static Transform^ CreateRotationAtPoint(
	XYZ^ axis,
	double angle,
	XYZ^ origin
)
static member CreateRotationAtPoint :
        axis : XYZ *
        angle : float *
        origin : XYZ -> Transform
Parameters
axis XYZ
 The rotation axis.
angle Double
 The angle.
origin XYZ
 The origin point.
Return Value
Transform
 The new transform.
Exceptions
Exception | Condition
ArgumentException |  The given value for angle is not finite
ArgumentNullException |  A non-optional argument was NULL
ArgumentOutOfRangeException |  axis has zero length.
See Also
Reference
Transform Class
Autodesk.Revit.DB Namespace